In [1]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
dataset = pd.read_csv('ads.csv')

In [3]:
dataset.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
df = dataset.drop(['User ID'],axis=1)
df.head()

   Gender  Age  EstimatedSalary  Purchased
0    Male   19            19000          0
1    Male   35            20000          0
2  Female   26            43000          0
3  Female   27            57000          0
4    Male   19            76000          0

In [5]:
dummy = pd.get_dummies(df.Gender)
dummy.head()

   Female  Male
0       0     1
1       0     1
2       1     0
3       1     0
4       0     1

In [6]:
df= pd.concat((df,dummy),axis=1)
df.head()

   Gender  Age  EstimatedSalary  Purchased  Female  Male
0    Male   19            19000          0       0     1
1    Male   35            20000          0       0     1
2  Female   26            43000          0       1     0
3  Female   27            57000          0       1     0
4    Male   19            76000          0       0     1

In [7]:
df = df.drop(columns=['Gender'])
df.head()

   Age  EstimatedSalary  Purchased  Female  Male
0   19            19000          0       0     1
1   35            20000          0       0     1
2   26            43000          0       1     0
3   27            57000          0       1     0
4   19            76000          0       0     1

# Splittng the dataset into test and training set

In [8]:
X = df.drop(['Purchased'],axis=1)
y = df.Purchased

In [9]:
X.head()

   Age  EstimatedSalary  Female  Male
0   19            19000       0     1
1   35            20000       0     1
2   26            43000       1     0
3   27            57000       1     0
4   19            76000       0     1

In [10]:
y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

# training and testing data

In [11]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y,test_size=0.25,random_state=0)

# Feature Scaling

In [12]:
'''
We need to use feature scaling in knn because of the fact that 
features depend on the distance and the because of that while calculting 
we would see high amount to the distnace given ..
This will impact the performance of all distance based model as it
will give higher weightage to variables which have higher magnitude.
'''
from sklearn.preprocessing import StandardScaler
sc = StandardScaler()
X_train = sc.fit_transform(X_train)
X_test = sc.transform(X_test)

'\nWe need to use feature scaling in knn because of the fact that \nfeatures depend on the distance and the because of that while calculting \nwe would see high amount to the distnace given ..\nThis will impact the performance of all distance based model as it\nwill give higher weightage to variables which have higher magnitude.\n'

In [13]:
X_train

     Age  EstimatedSalary  Female  Male
250   44            39000       1     0
63    32           120000       0     1
312   38            50000       1     0
159   32           135000       1     0
283   52            21000       1     0
..   ...              ...     ...   ...
323   48            30000       1     0
192   29            43000       0     1
117   36            52000       0     1
47    27            54000       1     0
172   26           118000       1     0

[300 rows x 4 columns]

# Model Training

In [14]:
from sklearn.neighbors import KNeighborsClassifier
classifier = KNeighborsClassifier()
classifier.fit(X_train,y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
                     metric_params=None, n_jobs=None, n_neighbors=5, p=2,
                     weights='uniform')

In [15]:
y_pred = classifier.predict(X_test)
print(y_pred)

[0 0 0 0 0 0 0 1 0 0 0 0 0 0 0 1 0 0 1 0 0 1 0 1 0 1 0 0 0 0 1 0 0 0 0 0 0
 0 1 1 1 0 0 0 1 0 0 1 0 0 1 1 0 0 1 0 0 0 1 0 0 0 0 1 1 0 0 0 0 1 1 0 0 1
 0 0 0 0 1 1 1 0 0 1 1 0 0 1 0 0 0 1 0 0 0 1 0 1 1 1]

In [16]:
from sklearn.metrics import accuracy_score
accuracy_score(y_test,y_pred)

0.84

In [17]:
from sklearn.metrics import roc_auc_score
roc_auc_score(y_test,y_pred)

0.8161764705882352